docs/doc-notes/Abdollahi2016.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-13 Mon 11:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Alexander Brown" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href=" ./style.css" />
</head>
<body>
<div id="preamble" class="status">
<a href="index.html">Home</a> | <a href="blog.html">Blog</a> | <a href="notes.html">Notes</a> | <a href="classes.html">Classes</a> | <a href="projects.html">Projects</a> | <a href="todo.html">Todo</a> | <a href="error.html">About</a>
</div>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org963592d">1. Optimal battery charging, part i: minimizing time-to-charge, energy loss, and temperature rise for ocv-resistance battery model, Abdollahi, A., Han, X., Avvari, G., Raghunathan, N., Balasingam, B., Pattipati, K., &amp; Bar-Shalom, Y., Journal of Power Sources, (2016)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="article">article</span></span></a></li>
<li><a href="#orgc6c14cf">2. Introduction</a></li>
<li><a href="#orgff21179">3. Analytic Solution for Optimal Charging Current Profile</a></li>
</ul>
</div>
</div>
<div id="outline-container-org963592d" class="outline-2">
<h2 id="org963592d"><span class="section-number-2">1.</span> Optimal battery charging, part i: minimizing time-to-charge, energy loss, and temperature rise for ocv-resistance battery model, Abdollahi, A., Han, X., Avvari, G., Raghunathan, N., Balasingam, B., Pattipati, K., &amp; Bar-Shalom, Y., Journal of Power Sources, (2016)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="article">article</span></span></h2>
<div class="outline-text-2" id="text-1">
<p>
See <a href="&amp;Abdollahi2016">&amp;Abdollahi2016</a>
</p>
</div>
</div>

<div id="outline-container-orgc6c14cf" class="outline-2">
<h2 id="orgc6c14cf"><span class="section-number-2">2.</span> Introduction</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>The most widely-used traditional strategy is the constant-current constant-voltage (CC-CV) [9] strategy, in which a
constant current is applied to the battery until the terminal voltage reaches a specified value, and afterward the
charging current decreases by applying a constant voltage to the terminals of the battery.</li>
</ul>
<p>
-In this paper we look at the charging problem from a fresh perspective using optimal control theory, and our goal is to
 find the optimal current profile that minimizes a specific cost function.
</p>
</div>
</div>

<div id="outline-container-orgff21179" class="outline-2">
<h2 id="orgff21179"><span class="section-number-2">3.</span> Analytic Solution for Optimal Charging Current Profile</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>The model consists of a voltage source corresponding to the open-circuit voltage (OCV), which is dependent on the
state of charge (SOC), and a resistance \(R_0\).</li>
<li>The OCV is a nonlinear function of SOC and is denoted by \(V_0(s[k])\).</li>
<li>The SOC battery dynamics is written as</li>
</ul>

\begin{equation}
    \begin{array}{c}
      i[k] = \frac{1}{R_0}(v_c - V_0(s[k])) \\
      s[k+1] = s[k] + c_hi[k] \\
      c_h = \frac{\Delta}{3600C_{\text{batt}}}
    \end{array}
\end{equation}

<p>
where \(C_{\text{batt}}\) is assumed the battery capacity in Ah, \(v_c\) is the voltage of the battery at maximum SOC, and
\(V_0\) is the initial voltage at an SOC of \(s[k]\).
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alexander Brown</p>
<p class="date">Created: 2023-03-13 Mon 11:04</p>
</div>
</body>
</html>
